Revit 2027 API
StructuralInstanceUsage Enumeration
 Represents the structural usage of a family instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralInstanceUsage
Public Enumeration StructuralInstanceUsage
public enum class StructuralInstanceUsage
type StructuralInstanceUsage
Members
Member name | Value | Description
Automatic | 10 |  Structural usage is automatic.
Brace | 7 |  Structural usage is as brace.
Column | 2 |  Structural usage is as column.
Girder | 3 |  Structural usage is as girder.
HorizontalBracing | 8 |  Structural usage is as horizontal bracing.
Joist | 4 |  Structural usage is as joist.
KickerBracing | 9 |  Structural usage is as kicker bracing.
Other | 6 |  Structural usage is as "other".
Purlin | 5 |  Structural usage is as purlin.
TrussChord | 11 |  Structural usage is as truss chord.
TrussWeb | 12 |  Structural usage is as truss web.
Undefined | 0 |  indicates automatic
Wall | 1 |  Structural usage is as wall.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace